after_school_backend/app/controllers/schedules_controller.rb

INSERT INTO "schedules" ("weekday", "subject", "content", "child_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["weekday", "Monday"], ["subject", "Math"], ["content", "done"], ["child_id", 1], ["created_at", "2021-01-03 22:59:10.764093"], ["updated_at", "2021-01-03 22:59:10.764093"]]
---
  def create
    @schedule = Schedule.new(schedule_params)

    if @schedule.save

DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 1]]
---
  def destroy
    @schedule.destroy

SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_schedule
      @schedule = Schedule.find(params[:id])